# _*_ coding:UTF-8 _*_

# 运算符
## Python运算符大致分为七种

# 算数运算符 [加(+)、减(-)、乘(*)、除(/)、取模(%)、幂运算(**)、取整运算(//)]
## 初始化测试 数据
a = 10
b = 4
c = 0

## 针对七中运算符进行运算
c = a + b
print("a + b=", c)
c = a - b
print("a - b=", c)
c = a * b
print("a * b=", c)
c = a / b
print("a / b=", c)
c = a % b
print("a % b=", c)
c = a ** b
print("a ** b=", c)
c = a // b
print("a // b=", c)
print("===================================================")
# 比较运算符
## >（大于）、<（小于）、==（等于）、！=（不等于)、>=（大于等于）、<=（小于等于）
## 初始化测试数据
a = 23
b = 3
## 进行比较运算
print("a == b:", a ==b)
print("a != b:", a !=b)
print("a > b:", a>b)
print("a < b:", a<b)
print("a >= b:", a>=b)
print("a <= b:", a<=b)
print("===================================================")
# 赋值运算
## +=、-=、=、/=、%=、*=、//=
## 初始化测试数据
a = 5
b = 6
## 进行赋值运算
b = a
print("b = a, b=", b)
b += a
print("b += a, b=", b)
b -= a
print("b -= a, b=", b)
b *= a
print("b *= a, b=", b)
b /= a
print("b /= a, b=", b)
b **= a
print("b **= a, b=", b)
b //= a
print("b //= a, b=", b)
print("===================================================")
# 逻辑运算

# 位运算

# 成员运算

# 身份运算符